src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиПользователя</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/РолиПользователя/РолиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователя</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Замерщик</name>
  </enumValues>
  <enumValues>
    <name>Диспетчер</name>
  </enumValues>
  <enumValues>
    <name>Директор</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	УИПустой = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	ИмяВыходногоФайла = ПолучитьИмяВременногоФайла("xml");
	Запрос = "select soap.get_access_from_key('"+Наименование+"','"+КлючДоступа+"') enbl from dual";
	ОбменДаннымиСервер.ВернутьSOAPОтвет(Запрос, ИмяВыходногоФайла);
	Отказ = НЕ ОбменДаннымиСервер.ПользовательРазрешенXML(ИмяВыходногоФайла);
	Если НЕ Отказ Тогда
		Ид = ОбменДаннымиСервер.ПолучитьИдентификаторПользователя(Наименование);
		Если ОбменДаннымиСервер.ПользовательЯвляетсяАдминистратором(Наименование) тогда
		ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.ПолныеПрава);
			Роль = Перечисления.РолиПользователя.Администратор;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяДиспетчером(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Диспетчер);
			Роль = Перечисления.РолиПользователя.Диспетчер;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяЗамерщиком(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Замерщик);
			Роль = Перечисления.РолиПользователя.Замерщик;
		ИначеЕсли ОбменДаннымиСервер.ПользовательЯвляетсяДиректором(Наименование) тогда
			ИдентификаторПользователяИБ = ОбновлениеСлужебный.СоздатьПользователя(
			?(ИдентификаторПользователяИБ = УИПустой, Наименование, ИдентификаторПользователяИБ),
			Наименование,
			Метаданные.Роли.Директор);
			Роль = Перечисления.РолиПользователя.Директор;	
		Иначе
			ВызватьИсключение("Этот пользователь не имеет прав на работу в мобильном приложении!");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
